全真教的第一代教主是王重阳。

王重阳是一位文武双全的文武双举人。

在北宋末年，金兵入侵的时，他带领义兵反抗金兵。

失败后自己躲到活死人墓，自称活死人。

在活死人墓带了七年后，王重阳参化绝深武功，走出活死人墓，创办全真教。

在之后的十几年里，他先后寻找、点化了七位大弟子。

后世称之为全真七子。

在全真七子之前。

他还有一位弟子叫做周伯通。

不过他并没有把周伯通当成弟子，而是当成师弟。

找到师弟和全真七子后，王重阳又回到终南山，在终南山活死人墓边上修建了全真教道观。

全真教就这样发展起来了。

王重阳精通道教典籍，并且在道教典籍中悟出了全真教的武功。

在七位弟子的帮助下，凭借自己的武功以及影响力，很快，全真教就发展成了一个门人非常多的教派。

后来，江湖上出现了一部九阴真经，为了控制九阴真经，王重阳邀请天下武功最好的那些人一起来华山开会，在七天七夜的会议里，王重阳凭借深厚的武功得到了会议的一致同意，承认他为当今世界武功第一高手，进而全真教成为武林第一大教派。

按会议的决议，《九阴真经》也就成为全真教的镇教之宝。

当时的武林并不大，这个会议的影响也不到。

武林中的高手也不多，而且很多高手只是在局部活动，这就为全真教的崛起提供了机会。

王重阳是一个喜好四处跑的人，终南山在陕西，他发展的弟子却大多来自山东。

而他的七个弟子也都是喜欢四处跑的人。

跟随王重阳几年后，这七个大弟子武功都学的不错。

特别是丘处机，王处一等。

而这几个又喜欢四处跑，行侠仗义。

在江湖上搞出了好大的声音。

江湖热闹了起来。

全真教也就成为了名副其实的江湖第一大派。

后来，王重阳死了，马钰成为了新的教主。

丘处机成为了教主师弟，感觉自己的身份更加尊贵了。

为了让全真教保持持续的影响力，马钰、丘处机他们决定继续走王重阳的路。

让全真教发展的更好。

丘处机他们四处收徒弟，教授武功，然后带回终南山。

不过，丘处机他们并没有多少精力带（管教）弟子，所以他们的弟子的武功就不高。

不过，当时的江湖还是不大，他们那不高的武功在普通老百姓眼里还是非常厉害的。

所以，全真教的名气也就越来越大了。

这时，郭靖黄蓉家族也在崛起，丐帮在黄蓉的带领下也在崛起，蒙古的崛起也牵引武林人士的涌动。

整个武林热闹了起来。

黄药师的弟子虽然大多被打断了腿，可是武力还是不可小觑。

丘处机们并没有多想，师父王重阳死了，他们觉得自己就是“王重阳”了，踩着师父的路子走下去。

仍然是四处点化弟子，随便教授弟子一些武功，然后就让弟子信心十足地走向江湖。

这样，江湖上就出现了很多没有见过王重阳的重阳门人。

说一个有趣的八卦，就是王重阳和林朝英的故事。

林朝英是王重阳的女朋友，当王重阳躲在活死人墓不想出来时，就是林朝英在墓口堵了几天几夜，逼着王重阳出来。

王重阳出来后，才走向山东游荡，才创建了全真教。

当时，林朝英和王重阳打了一个赌。

王重阳输了，就把活死人墓输给了林朝英。

王重阳经常回去墓里和林朝英见面，为了不被弟子看见，带七大弟子回来的王重阳和弟子们说：“这个洞本来是我的，输给了一个女人，这个女人很厉害，你们不要招惹她，最好不要到她门口去。

”弟子一听，这洞里住着大敌啊。

那就定一个规则：凡我全真弟子，不可走进墓门口。

等到了第三代弟子，这个规则及变成了禁令，而这个禁令居然救了未来的一代大侠杨过。

第二代弟子也慢慢的老去了，第三代弟子在江湖上横冲直撞，发现一家不靠谱了。

不过他们还是坚信自己是天下武学正宗，坚信终南山中那个活死人墓是禁地。

至于为什么，大家并不知道。

当那些新鲜的第三代小道士在江湖上兴冲冲时，发现江湖已经不认识他们了。

尹志平见了黄药师这般威势，心知此人非同小可，躬身说道：“全真教长春门下弟子尹志平拜见前辈。

”黄药师道：“人人都滚了出去，我又没教你留着。

还在这儿，是活得不耐烦了？”尹志平一怔，道：“弟子是全真教长春门下，并非奸人。

”黄药师道：“全真教便怎地？”顺手在桌上抓落，抓下了板桌上一块木块，臂不动，手不扬，那木块已轻飘飘的向尹志平迎面飞去。

尹志平忙举拂尘挡格，那知这小小木块竟如是根金刚巨杵，只觉一股大力撞来，势不可当，连带拂尘一齐打在他口旁，一阵疼痛，嘴中忽觉多了许多物事，急忙吐在掌中，却是几颗牙齿，满手鲜血，不禁又惊又怕，作声不得。

他们发现，他们的做派已经支撑不起来了。

与过了几十年，江湖上已经没有了全真教的故事，偶尔提起时，偶尔会有人说，那里有一群不问世事的道人。

